["<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>Data Structures &amp; Algorithms</h2>\n<p>\r\n    Module code: G5117<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Lecture, Class<br/>\r\n    Assessment modes: Unseen examination, Coursework</p>\n<p>This module provides an introduction to data structures and algorithms for computer scientists. The module introduces a number of fundamental data structures, including arrays linked lists, stacks, queues, trees, hash tables and graphs. These are presented both abstractly, via the notion Abstract Data Types, and concretely in terms of their implementation in an object-oriented framework. The data structures are discussed and analysed in terms of efficiency of the basic operations they support and their application to program design problems. Consideration is given to important, fundamental algorithms for searching and sorting data.</p>\n<h3>Pre-requisite</h3>\n<p>Introduction to Programming</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Evidence knowledge of a variety of data structures in terms of their characteristic behaviours.</li>\n<li>Implement and apply appropriate data structures for solving program design problems.</li>\n<li>Demonstrate basic knowledge of complexity issues with respect to data manipulation.</li>\n<li>Evidence understanding of a number of fundamental algorithms.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>Further Programming</h2>\n<p>\r\n    Module code: G5067<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Class, Lecture<br/>\r\n    Assessment modes: Unseen examination, Coursework</p>\n<p>This module follows on from \"Introduction to Programming\". It provides an introduction to more advanced programming concepts and techniques.</p>\n<p>You cover Java programming, including:</p>\n<ul>\n<li>use of subclasses and library classes to create well-organised programs</li>\n<li>choice and implementation of appropriate algorithms and data structures (e.g. arrays, lists, trees, graphs, depth- and breadth-first search, the minimax and A* algorithms)</li>\n<li>construction of graphical user interfaces for Java programs.</li>\n</ul>\n<h3>Pre-requisite</h3>\n<p>Introduction to Programming</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Explain and exploit subclasses, inheritance and interfaces in Java to produce modular, well-organised code.</li>\n<li>Implement simple algorithms and data structures in Java.</li>\n<li>Evidence knowledge of basic concepts and principles of object-orientation such as objects and classes, encapsulation, object state, coupling, cohesion and modularity.</li>\n<li>Produce graphical user interfaces for Java programs.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>Introduction to Computer Systems</h2>\n<p>\r\n    Module code: G6008<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Lecture, Class<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>In this module, you are introduced to three key aspects of computer systems – storage, processing and transmission of information. You study topics including:</p>\n<p>Storage</p>\n<ul>\n<li>transistors and chips</li>\n<li>memory architecture</li>\n<li>primary and secondary storage</li>\n<li>file systems.</li>\n</ul>\n<p>Processing</p>\n<ul style=\"list-style-type: disc;\">\n<li>logic circuits</li>\n<li>CPU operation</li>\n<li>machine language</li>\n<li>compilers and high level languages</li>\n<li>the role of operating systems.</li>\n</ul>\n<p>Transmission</p>\n<ul style=\"list-style-type: disc;\">\n<li>serial and parallel buses</li>\n<li>interrupts</li>\n<li>network layers and protocols</li>\n<li>the internet.</li>\n</ul>\n<h3>Pre-requisite</h3>\n<p>Programming Concepts</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Demonstrate knowledge of the main physical components and logical elements of a computer and how they combine to store, process and transmit information.</li>\n<li>Appreciate how computers process information at the levels of logic circuits and machine code.</li>\n<li>Articulate the principal methods used for transferring information internally within a computer and externally between computer systems.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>Introduction to Multimedia</h2>\n<p>\r\n    Module code: G5039<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Lecture, Laboratory<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>In this module, you develop a basic understanding of human perception and how this relates to the capture, display, storage and transmission of multimedia.</p>\n<p>You are introduced to the technical principles and hardware underlying the capture, display, storage and transmission of:</p>\n<ul>\n<li>sound</li>\n<li>video</li>\n<li>image</li>\n<li>graphical-based multimedia.</li>\n</ul>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Describe the basic principles behind human perception of media such as colour and sound and how perception relates to the capture, display, storage and transmission of this media.</li>\n<li>Recognise the wider issues involved with multimedia production and distribution.</li>\n<li>Identify and summarise the technological basis of the capture, display, storage and transmission of sound, video, image and graphical based multimedia.</li>\n<li>Synthesise basic multimedia and web based content.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>Introduction to Programming</h2>\n<p>\r\n    Module code: G5066<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Class, Lecture<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>The module introduces you to a collection of basic programming concepts and techniques, including:</p>\n<ul>\n<li>designing</li>\n<li>testing</li>\n<li>debugging</li>\n<li>documenting programmes.  </li>\n</ul>\n<p>The module introduces the programming language Java, and is for both absolute beginners and those with prior computing experience. Java is a language used for other components of undergraduate modules. It will be the primary language used for programming assignments in nearly all first year modules taught by the Department of Informatics.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Demonstrate knowledge of fundamental imperative programming concepts such as variables and assignment, conditional statements, loops and methods.</li>\n<li>Code an application in a suitable object-oriented programming language, from a detailed software specification.</li>\n<li>Evidence knowledge of basic concepts and principles of object-orientation such as objects and classes, encapsulation, object state, coupling, cohesion and modularity.</li>\n<li>Show awareness of basic principles of software design and development including appropriate naming of variables and classes, code lay out, testing and debugging, and documentation.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>Mathematical Concepts</h2>\n<p>\r\n    Module code: G6012<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Lecture, Seminar<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>In this introductory mathematics module, you explore the fundamental mathematical concepts and skills needed for all Informatics degrees.</p>\n<p>In this module, you cover topics such as:</p>\n<ul>\n<li>basic set theory</li>\n<li>number systems</li>\n<li>regular expressions</li>\n<li>finite state automata</li>\n<li>functions</li>\n<li>basic calculus</li>\n<li>basic linear algebra</li>\n<li>proof by induction</li>\n<li>an introduction to the concepts of probability theory and statistics.</li>\n</ul>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Is familiar with mathematical notations and confident in using them.</li>\n<li>Has knowledge of the concepts of sets, expressions, automata and functions and is able to operate with them.</li>\n<li>Can operate with vectors and matrices and has knowledge of the underlying concepts.</li>\n<li>Has knowledge of the concept of probability and can calculate and interpret probabilities and statistical quantities.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>Professional Skills</h2>\n<p>\r\n    Module code: G5120<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Lecture, Seminar, Practical<br/>\r\n    Assessment modes: Coursework</p>\n<p>This module covers important professional skills in four categories: technical communication, technical and academic writing, professional conduct, and IT law. Topics include:</p>\n<p>Technical communication skills (two lectures)</p>\n<ul>\n<li>giving effective oral presentations</li>\n<li>graphical aids for oral presentations.</li>\n</ul>\n<p>Writing skills (12 lectures)</p>\n<ul>\n<li>report writing</li>\n<li>reviewing</li>\n<li>correct attribution of credit and referencing.</li>\n</ul>\n<p>Professional conduct (six lectures)</p>\n<ul>\n<li>codes of professional conduct</li>\n<li>computers and society, including the workplace and education</li>\n<li>ethical implications of the internet, artificial intelligence, virtual reality, and emerging new technologies.</li>\n</ul>\n<p>IT law (four lectures)</p>\n<ul>\n<li>digital evidence: Information retrieval, retention and protection</li>\n<li>privacy and data protection</li>\n<li>contract law and employment law for IT</li>\n<li>intellectual property in the IT sector.</li>\n</ul>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Give effective oral presentations.</li>\n<li>Adopt a problem solving approach to the process of writing.</li>\n<li>Be aware of rules of academic and professional conduct and act accordingly.</li>\n<li>Have knowledge of the fundamentals of IT law.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>Programming Concepts</h2>\n<p>\r\n    Module code: G6007<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Lecture<br/>\r\n    Assessment modes: Unseen examination</p>\n<p>In this module, you are introduced to algorithmic problem solving. Your studies in this module will answer the following questions:</p>\n<ul>\n<li>what is a problem specification, an algorithm, a computation?</li>\n<li>what are their properties?</li>\n<li>how does one develop an algorithm?</li>\n<li>how can one rigorously argue that an algorithm computes correct solutions to a given problem?</li>\n<li>how can one measure the efficiency of an algorithm and the complexity of a problem?</li>\n</ul>\n<p>As part of the module, you use a simple algorithmic language (pseudo code) for the sake of writing algorithms - the focus of this module is on algorithmic thinking, not coding.</p>\n<p>In the module, you specify and develop searching, sorting and other simple (and intuitive) algorithms. You apply and explore principles like divide-and-conquer and recursive programming.</p>\n<p>You also look at two important properties of algorithms - 'correctness' and 'complexity'.</p>\n<p>Algorithms should only compute correct solutions of a problem. To establish correctness, you are introduced to some relevant (propositional and predicate) logic, in an informal style (focusing on logical reasoning principles rather than logical calculi).</p>\n<p>Finally, you discuss asymptotic complexity classes and explore the concept of time complexity of an algorithm.</p>\n<p>As part of this module, you undertake exercise classes and coursework, based on a series of examples.</p>\n<p>The algorithms you develop in this module should be implemented in Java concurrently or at a later stage in the further programming module.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Develop an algorithm from a given problem specification.</li>\n<li>Prove that a given algorithm is correct for a given problem specification.</li>\n<li>Analyse a given algorithm and establish its time complexity class.</li>\n<li>Spot mistakes and suggest possible improvements for a given algorithm.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Computing</h1> <h2>The Ghost in the Machine?</h2>\n<p>\r\n    Module code: G5077<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Lecture, Seminar<br/>\r\n    Assessment modes: Coursework</p>\n<p>What is mind? How can our view of ourselves as subjects with a mental life be reconciled with the non-mental, scientific accounts we have of our brains and bodies?</p>\n<p>We will look at a number of different physicalist theories, concentrating on variants of the view that cognition is computation, and on neurophysiologically-based accounts of mind.</p>\n<p>In doing so, we will examine some of the basic issues underlying cognitive science as an interdisciplinary study of the mind, taking in topics from psychology, neuroscience, linguistics, computing, artificial intelligence, robotics, evolutionary theory, biology and philosophy along the way.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Describe basic philosophical and methodological problems in cognitive science.</li>\n<li>Discuss the way different disciplines (eg psychology, philosophy, neuroscience, linguistics, computer science and AI, robotics, biology, etc.) collaborate and compete together over their treatment of common themes in cognitive science.</li>\n<li>Express ideas, thinking and reasoning clearly and critically reflect upon their own views and prejudices.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Introduction to Accounting</h2>\n<p>\r\n    Module code: N1086<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Lecture, Workshop<br/>\r\n    Assessment modes: Unseen examination, Coursework</p>\n<p>This module is designed as an introduction to accounting and financial management for managers.</p>\n<p>The module introduces accounting and financial management topics gradually, examining basic principles and underlying concepts before demonstrating how accounting statements and financial information can be used to improve business decision-making.</p>\n<p>The module focus is for students of business and management as decision-makers and users of financial information.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Interpret and analyse a company income statement, statement of financial position and statement of cash flows.</li>\n<li>Perform simple cost-volume-profit analysis.</li>\n<li>Perform simple investment appraisal techniques.</li>\n<li>Explain ways to finance a business and manage working capital.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Introduction to Business and Management</h2>\n<p>\r\n    Module code: N1065<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Lecture, Workshop<br/>\r\n    Assessment modes: Coursework, Test</p>\n<p>Introduction to Business and Management is an introductory study of contemporary organisations and their management. It explores the types of purposes of organisations, their stakeholders (CSR) and changing environments together with their key managerial processes – entrepreneurship, organisational structure, leading, strategic planning and change.</p>\n<p>The focus throughout is on helping you achieve a critical and reflective approach, and learning to apply relevant concepts, tools and models.</p>\n<p>The coursework component of assessment requires you to choose an organisation that is of interest to you and to explore, critically, the way in which it handles a process of your choice. You are supported in this by the submission of a structured proposal on which formative feedback is given.</p>\n<p>Seminar activities are participative and require preparatory work which is signposted though downloads and links on Study Direct well in advance.</p>\n<p>Lectures are interactive, employing the use of quizzes and featuring clips from YouTube, such as Dragons' Den excerpts.</p>\n<p>An unseen examination completes the assessment profile and you tackle a case study (which revisits keys concepts) in the final seminar as a formative exercise.</p>\n<p>The module provides a platform for later study by encouraging skills in critical thinking, academic writing, concept acquisition and research. Introduction to Business and Management aims to facilitate the transition to university-level learning smoothly, meaningfully and enjoyably.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Display understanding of a range of reliable and relevant concepts underlying the study of contemporary business and management</li>\n<li>Show an ability to engage in a critical discussion of issues affecting contemporary business</li>\n<li>Analyse a selected organisation's approach to a selected managerial process</li>\n<li>Evaluate the success of a selected organisation's performance in its undertaking of a selected managerial process</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Introduction to Business Law</h2>\n<p>\r\n    Module code: N1072<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Lecture, Seminar<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>This module aims to develop knowledge and skills in the understanding of the general legal framework, and of specific legal areas relating to business.</p>\n<p>The module is divided into four parts:</p>\n<ol type=\"i\">\n<li>the English legal system</li>\n<li>contractual obligations</li>\n<li>tortious liability; and</li>\n<li>the contract of employment.</li>\n</ol>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Discuss the essential elements of the legal system, including the main sources of law</li>\n<li>Recognise and apply the appropriate legal rules relating to the law of tort and contract</li>\n<li>Apply the law relating to employment relations</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Introduction to Financial Accounting</h2>\n<p>\r\n    Module code: N1526<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Lecture, Seminar<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>Accounting is the 'language for all business', which translates information about organisations to users for the purposes of control, financial performance assessment and valuation.</p>\n<p>This module is designed to teach you how to understand this language and be able to communicate in it. It will equip you with an understanding of the major accounting concepts, the necessary skills, knowledge and insights to understand how and why financial statements are created and how they have developed.</p>\n<p>You will be exposed to how financial transactions and events are recorded, and will learn how to compile rudimentary financial statements for various business entities.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Explain the context and purpose of financial reporting.</li>\n<li>Define the qualitative characteristics of financial information.</li>\n<li>Record transactions and events and demonstrate the use of double entry and accounting systems.</li>\n<li>Prepare a trial balance and prepare and interpret basic financial statements for unincorporated and incorporated entities.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Introduction to Management Accounting</h2>\n<p>\r\n    Module code: N1527<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Lecture, Seminar<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>You study the role and content of management accounting systems and learn computational and evaluative techniques for information analysis, organisational planning and problem solving. </p>\n<p>You learn how management accounting systems help organisations identify, measure and communicate information for valuation purposes and enable managers and employees in an organisation to make informed judgements and decisions.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Demonstrate an appreciation of cost and management accounting systems</li>\n<li>Evaluate information about organisations and transactions and select appropriate management accounting tools to analyse data and create valid and relevant management information</li>\n<li>Select and apply cost and management accounting techniques appropriate for pricing, reporting and control and for decision-making</li>\n<li>Evaluate the role of management accounting in the provision of information for organisational planning, control and decision-making</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Introduction to Marketing</h2>\n<p>\r\n    Module code: N1067<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Workshop, Lecture<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>Introduction to Marketing explores various aspects of the marketing process, including environmental scanning (assessing strengths, weaknesses, opportunities, threat analysis, and competitor analysis), strategic development options, marketing mix (traditional and new media), customer relationship management (CRM), sales management and supplier management.</p>\n<p>Through case study analysis and practical application, you will develop an appreciation of the practical applications of various marketing concepts and techniques, and learn to critically evaluate and select strategic and operational options available to marketing decision-makers to build a sustainable competitive position.</p>\n<p>The objective of this module is to provide you with a clear and comprehensive understanding of the key foundational principles of marketing.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Define the principles of marketing and its core concepts.</li>\n<li>Demonstrate a fundamental understanding of Marketing and how it is used effectively in Businesses and how it is key in building sustainable competitive advantages.</li>\n<li>Be able to apply the various marketing tools and functions and how these interact and contribute to the internal, and external activities of a business, including suppliers, distributors and sales forces.</li>\n<li>Evaluate the impact of Consumer and Business buying behaviour.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Principles of Finance</h2>\n<p>\r\n    Module code: N1560<br/>\r\n    Level 4<br/>\r\n    15 credits in autumn teaching<br/>\r\n    Teaching method: Lecture, Seminar<br/>\r\n    Assessment modes: Unseen examination</p>\n<p><span>You are introduced to financial markets, instruments and concepts. </span></p>\n<p><span>You are given an overview of the roles of different financial institutions, and the products they most commonly provide and trade. </span></p>\n<p><span>During the module you discuss historical events in the financial markets and how this illustrates their importance in the wider economy. </span><br/><br/><span>You focus on finance concepts related to equity and bond markets, beginning with: </span></p>\n<ul>\n<li>interest rates</li>\n<li>returns</li>\n<li>time value of money</li>\n<li>discounting</li>\n<li>present value.</li>\n</ul>\n<p>Other topics include:</p>\n<ul>\n<li>LIBID and LIBOR</li>\n<li>cost of capital</li>\n<li>bid ask spreads</li>\n<li>no-arbitrage relationships, for example between stocks and futures or forwards.</li>\n</ul>\n<p>You are also given an insight into the idea of hedging with derivative products.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Have demonstrated knowledge of the core principles of finance, and the most common financial institutions, products and markets.</li>\n<li>Analyse a finance problem or issue using an appropriate theoretical framework and present ideas, concepts and information using means appropriate to the audience and the problem at issue.</li>\n<li>Demonstrate an understanding of appropriate concepts in finance that may be of wider use in a decision-making context (e.g. discounting).</li>\n<li>Describe the fundamental concepts related to interest rate markets, such as yield curve behavior, duration and convexity.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Principles of Organisational Behaviour and Human Resource Management</h2>\n<p>\r\n    Module code: N1062<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Workshop<br/>\r\n    Assessment modes: Coursework, Unseen examination</p>\n<p>This module explores the causes and effects of human interaction in an organisation and how humans at individual, group and organisational level influence organisations. Organisational performance depends on appropriate incentives to individuals, developing effective teams, designing an attractive job environment and managing organisational structure.</p>\n<p>Focusing on these issues, the module is divided into four themes based on the level of analysis:</p>\n<ul>\n<li>individual – we will look at the individual's contribution to organisation and the factors affecting their behaviour</li>\n<li>group – the nature and significance of groups in organisations will be discussed and the range of skills required for effective team work and factors affecting working in groups will also be explored</li>\n<li>organisational – organisational design and culture, inspiring workers through norms, beliefs and behaviour, and management in the work place will be explained</li>\n<li>human resource management – we will examine the aspects of developing human capital through recruitment, training, development and reward, which will create a sustainable commitment to organisational goals and to ensure high performance.</li>\n</ul>\n<p>There will be two forms of assessment for this module with an equal weighting for coursework and an unseen exam. The coursework component will invovle a Group Report analysing concepts of human resource management and organisational behaviour in a chosen organisation. Formative feedback for this assessment will be provided by peers and tutors on the work-in-progress presentation of this report in seminars.</p>\n<p>An unseen exam at the end of the term will cover the remaining assessment. You will participate in a role playing game in your final seminar analysing and discussing the concepts taught during the lecture as a formative exercise.</p>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Apply organisational behavioural concepts and theories to analyse issues at workplace.</li>\n<li>Critically discuss concepts related to human resource management and how they contribute to organisational performance.</li>\n<li>Work in a team to analyse dynamics of team roles and critically discuss HR practices in a selected organisation.</li>\n<li>Evaluate HR practices and influence of organisation behaviour in a selected organisation.</li>\n</ul></div>", "<div class=\"small-12 large-9 large-push-3 columns wysiwyg content-region\">\n<h1>Business and management studies</h1> <h2>Theory of Investments</h2>\n<p>\r\n    Module code: N1553<br/>\r\n    Level 4<br/>\r\n    15 credits in spring teaching<br/>\r\n    Teaching method: Lecture, Seminar<br/>\r\n    Assessment modes: Unseen examination, Coursework</p>\n<p><span>You explore the common types of investment and gain a thorough grounding in the analysis of investment portfolios. </span></p>\n<p><span>You learn about: </span></p>\n<ul>\n<li>the investment environment</li>\n<li>the investment process</li>\n<li>mutual funds and other investment companies</li>\n<li>risk-return-based asset allocation methods</li>\n<li>popular index models</li>\n<li>theoretical and empirical asset pricing models and their applications to investment analysis</li>\n<li>security analysis</li>\n<li>performance measurement.</li>\n</ul>\n<h3>Module learning outcomes</h3>\n<ul>\n<li>Understand the general principles of common types of investments</li>\n<li>Explain the concepts of the risk-return relationship and the principle of diversification</li>\n<li>Describe the principles of standard asset pricing models</li>\n<li>Discuss the applications of portfolio theory to performance measurement and passive and active portfolio management</li>\n</ul></div>"]